app/views/posts/index.html.erb

              <% unless post.comments.count.zero? %>
              <span class="right-align"><%= "#{post.comments.count} #{t('posts.comments_count')}" %> </span>
---
SELECT "posts".* FROM "posts"